---
kind: property
id: P:Autodesk.Revit.DB.SymbolTypeId.HFtSup2DegreeFPerBtu
source: html/8b4aee07-4c8e-9634-1123-fb390acdf0d5.htm
---
# Autodesk.Revit.DB.SymbolTypeId.HFtSup2DegreeFPerBtu Property

Symbol (h·ft²·°F)/BTU, indicating unit Hour square foot degrees Fahrenheit per British thermal unit.

## Syntax (C#)
```csharp
public static ForgeTypeId HFtSup2DegreeFPerBtu { get; }
```